app/views/movies/show.html.erb

          <div class="d-flex justify-content-between align-items-center">
            <span>reviewed by <%= review.user.last_name %> <%= review.user.first_name %></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

          <div class="tags mt-2">
            <% review.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "reviews_tags" ON "tags"."id" = "reviews_tags"."tag_id" WHERE "reviews_tags"."review_id" = $1  [["review_id", 1]]