app/views/shared/_search_form.html.erb

SELECT "tags"."name", "tags"."id" FROM "tags"
---
  <div class="form-group me-2">
    <%= select_tag 'q[tag_id_eq]', options_for_select(Tag.pluck(:name, :id), params.dig(:q, :tag_id_eq)), { include_blank: 'すべてのタグ', class: 'form-control' } %>