app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "movie_id", "review_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "コメント"], ["user_id", 1], ["movie_id", 20], ["review_id", 7], ["created_at", "2024-06-29 17:13:22.276848"], ["updated_at", "2024-06-29 17:13:22.276848"]]
---
    def create
      @comment = @review.comments.new(comment_params)
      @comment.user = current_user

      if @movie
        @comment.movie_id = @movie.id
      else
        flash[:danger] = '映画が見つかりませんでした。'
        redirect_to movies_path and return
      end

      if @comment.save

SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 762441], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def find_movie_and_review
      @movie = Movie.find_by(tmdb_id: params[:movie_tmdb_id])
      @review = Review.find(params[:review_id])  # review_id を使用して @review を取得する