app/controllers/home_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 5]]
---
    def index
      @random_reviews = Review.order(Arel.sql('RANDOM()')).limit(5)