app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "review_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["review_id", 2], ["created_at", "2024-07-06 15:27:52.496071"], ["updated_at", "2024-07-06 15:27:52.496071"]]
---
    def create
        current_user.likes.create(review: @review)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."review_id" = $2 LIMIT $3  [["user_id", 1], ["review_id", 2], ["LIMIT", 1]]
---
      def destroy
        current_user.likes.find_by(review: @review)&.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_review
      @review = Review.find(params[:review_id])