app/controllers/movies_controller.rb

SELECT "tags".* FROM "tags" INNER JOIN "reviews_tags" ON "tags"."id" = "reviews_tags"."tag_id" WHERE "reviews_tags"."review_id" = $1  [["review_id", 14]]
---
  def index
    # TMDbからホラー映画を取得
    tmdb_client = TmdbClient.new
    response = tmdb_client.fetch_horror_movies

    if response.code == 200
      @tmdb_movies = response.parsed_response['results'].sample(15)
    else
      flash[:alert] = "映画の取得に失敗しました。"
      @tmdb_movies = []
    end

    # Ransackによる検索とタグフィルタリングの設定
    @q = Movie.ransack(params[:q])
    @movies = @q.result(distinct: true)

    # タグ検索の追加（タグIDでのフィルタリング）
    if params.dig(:q, :tag_id_eq).present?
      tag_id = params.dig(:q, :tag_id_eq)

      # タグでフィルタリングされたレビューを持つ映画を取得
      @movies = @movies.joins(reviews: :tags).where(reviews: { tags: { id: tag_id } }).distinct

SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 1086747], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "description", "release_date", "poster_url", "tmdb_id", "created_at", "updated_at", "overview", "poster_path") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT 1 AS one FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 5], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find_by(tmdb_id: params[:tmdb_id])

    if @movie.nil?
      # 映画がデータベースにない場合、TMDBから取得してデータベースに保存
      movie_data = fetch_movie_from_tmdb(params[:tmdb_id])
      if movie_data
        @movie = Movie.create!(
          title: movie_data['title'],
          description: movie_data['overview'], # TMDBの 'overview' を 'description' に保存
          release_date: movie_data['release_date'],
          poster_url: "https://image.tmdb.org/t/p/w500#{movie_data['poster_path']}",
          tmdb_id: movie_data['id']
        )
      else
        flash[:alert] = "指定された映画が見つかりませんでした。"
        return redirect_to movies_path
      end
    end

    @review = Review.new
    @overview = @movie.description.present? ? @movie.description : 'この映画のあらすじは公開されていません。' # `description` を参照