app/controllers/password_resets_controller.rb

    def edit
      @token = params[:token]
      @user = User.load_from_reset_password_token(@token)

      if @user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'vVrEiK2IIXdUwSVWLyzw3w' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def update
      @token = params[:token]
      @user = User.load_from_reset_password_token(@token)

      if @user.blank?
        not_authenticated
        return
      end

      # パスワードと確認用パスワードの検証と更新処理
      if params[:user][:password].present? && params[:user][:password_confirmation].present?
        @user.password = params[:user][:password]
        @user.password_confirmation = params[:user][:password_confirmation]

        if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'vVrEiK2IIXdUwSVWLyzw3w' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "users" SET "crypted_password" = $1, "salt" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["crypted_password", "$2a$10$ifARO7/C8O9ij/Fltf5Sa.q4czaiGhMyE6jqJsBLfnDcPUWPueHAa"], ["salt", "r9zYsLL5b4_kT_gPh7yr"], ["updated_at", "2024-07-01 11:09:31.374018"], ["id", 1]]