app/controllers/reviews_controller.rb

  def new
    @movie = Movie.find_by(tmdb_id: params[:movie_tmdb_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 1086747], ["LIMIT", 1]]

  def create
    @movie = Movie.find_by(tmdb_id: params[:movie_tmdb_id])
    if @movie.nil?
      flash[:danger] = "映画が見つかりませんでした。"
      redirect_to movies_path and return
    end

    @review = @movie.reviews.build(review_params)
    @review.user = current_user
    @review.tag_ids = params[:review][:tag_ids]

    if @review.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 1001311], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "movie_id", "title", "content", "created_at", "updated_at", "tmdb_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["movie_id", 5], ["title", "最高です"], ["content", "怖い"], ["created_at", "2024-06-29 18:21:23.515634"], ["updated_at", "2024-06-29 18:21:23.515634"], ["tmdb_id", nil]]

  def show
    @review = Review.find(params[:id])
    @movie = Movie.find(@review.movie_id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "content" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content", "大迫力でした。編集用"], ["updated_at", "2024-06-30 07:21:21.373453"], ["id", 2]]

  def set_movie
    if params[:review] && params[:review][:tmdb_id]
      tmdb_id = params[:review][:tmdb_id]
    elsif params[:movie_tmdb_id]
      tmdb_id = params[:movie_tmdb_id]
    else
      tmdb_id = nil
    end
puts tmdb_id
    @movie = Movie.find_by(tmdb_id: tmdb_id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."tmdb_id" = $1 LIMIT $2  [["tmdb_id", 437342], ["LIMIT", 1]]

  def set_review
    @review = Review.find(params[:id])
    @movie = Movie.find(@review.movie_id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]