app/controllers/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "salt", "first_name", "last_name", "created_at", "updated_at", "reset_password_token", "reset_password_token_expires_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 ORDER BY "reviews"."created_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 5]]
---
  def show
    @user = current_user
    @reviews = @user.reviews.order(created_at: :desc).limit(5)