app/models/review.rb

SELECT COUNT(*) FROM "likes" WHERE "likes"."review_id" = $1  [["review_id", 2]]
---
  def likes_count
    self.likes.count