app/models/user.rb

  def likes?(review)
    self.likes.exists?(review_id: review.id)
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."review_id" = $2 LIMIT $3  [["user_id", 1], ["review_id", 2], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    authentication = Authentication.find_by(provider: auth['provider'], uid: auth['uid'])
    if authentication
      return authentication.user
    else
      user = User.find_or_create_by(email: auth['info']['email']) do |u|
        u.first_name = auth['info']['first_name'] || auth['info']['name'].split.first
        u.last_name = auth['info']['last_name'] || auth['info']['name'].split.last
        u.password = SecureRandom.hex(10)
      end
      user.authentications.create(provider: auth['provider'], uid: auth['uid'])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = $1 AND "authentications"."uid" = $2 LIMIT $3  [["provider", "google_oauth2"], ["uid", "101414712615850223776"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kkparade62@gmail.com"], ["LIMIT", 1]]
INSERT INTO "authentications" ("user_id", "provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["provider", "google_oauth2"], ["uid", "101414712615850223776"], ["created_at", "2024-07-19 15:20:07.030172"], ["updated_at", "2024-07-19 15:20:07.030172"]]