app/views/reviews/edit.html.erb

          <%= form.label :tag_ids, 'ジャンル' %>
          <%= form.collection_select :tag_ids, Tag.all, :id, :name, {}, { multiple: true, class: 'form-control', size: 5 } %>
---
SELECT "tags".* FROM "tags"