app/views/reviews/new.html.erb

SELECT "tags".* FROM "tags"
---
          <%= form.label :tag_ids, 'ジャンル' %>
          <%= form.collection_select :tag_ids, Tag.all, :id, :name, { include_blank: true }, { class: 'form-control' } %>