app/views/reviews/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <div class="d-flex justify-content-between align-items-center">
            <span>reviewed by <%= @review.user.last_name %> <%= @review.user.first_name %></span>

SELECT "tags".* FROM "tags" INNER JOIN "reviews_tags" ON "tags"."id" = "reviews_tags"."tag_id" WHERE "reviews_tags"."review_id" = $1  [["review_id", 2]]
---
        <div class="tags">
          <% @review.tags.each do |tag| %>

SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = $1  [["review_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <h5>コメント</h5>
        <% @review.comments.each do |comment| %>
          <div class="comment-box mb-3">
            <p class="comment-user text-muted"><%= comment.user.last_name %> <%= comment.user.first_name %></p>